obs-studio-wayland.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-20 Mon 07:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga89033f">1. Use obs-studio on wayland</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga89033f" class="outline-2">
<h2 id="orga89033f"><span class="section-number-2">1.</span> Use obs-studio on wayland</h2>
<div class="outline-text-2" id="text-1">
<p>
I couldn't get obs-studio to work first try, like right after installing it on wayland (arch-linux).
I wasn't able to see any output.
</p>

<p>
To fix it, after install it obs-studio, I've installed : <code>obs-vaapi</code> and <code>wlrobs</code>
</p>

<p>
You should be able to then see some new entry about <b>wayland (dmabuf)</b>, this is the one you should use to access your displays.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2026-04-20 Mon 07:08</p>
</div>
</body>
</html>
